package ru.vakoom.gunmarket.admin.auto;


public class OfferReceivingTest {

    /**
     * Тест на получение офферов из Scrapping service
     * После скраппинга и матчинга оффер дто лист попадает на эндпоинт
     * Формируем из дто полноценные офферы
     * Производим рефреш, а имеено очищаем все офферы из базы и сохраняем новые
     * Пересчитываем мин макс цены у продуктов
     * Мапим полученные офферы из базы обратно в дто и вовзращаем в скраппер
     * */
    public void receiveOffersFromScrappingTest(){

    }

}
